Repository: theealexey/ShiftLedger
Catalog: ShiftLedger/Localizable.xcstrings
Source language: en
Languages: ru

# addWorkType.title
source: Add Work Type
ru: Добавить вид работы

# addWorkType.name.title
source: Work type name
ru: Название вида работы

# addWorkType.name.placeholder
source: e.g. Lectures
ru: Например, лекции

# addWorkType.name.accessibilityHint
source: Enter a name that identifies this type of work.
ru: Введите название, по которому вы узнаете этот вид работы.

# addWorkType.payBasis.title
source: Pay basis
ru: Основа оплаты

# addWorkType.payBasis.hourly
source: Hourly
ru: Почасовая

# addWorkType.payBasis.fixedPerShift
source: Fixed per shift
ru: Фиксированная за смену

# addWorkType.hourlyRate.title
source: Hourly rate
ru: Ставка в час

# addWorkType.fixedPerShiftAmount.title
source: Amount per shift
ru: Сумма за смену

# addWorkType.amount.accessibilityHint
source: Enter the initial amount paid for this work type.
ru: Введите начальную сумму оплаты для этого вида работы.

# addWorkType.currency.title
source: Currency
ru: Валюта

# addWorkType.save
source: Save
ru: Сохранить

# addWorkType.error.title
source: Couldn’t add work type
ru: Не удалось добавить вид работы

# addWorkType.error.message
source: Your changes weren’t saved. Try again.
ru: Изменения не сохранены. Попробуйте ещё раз.

# application.startupError.title
source: Couldn't open your data
ru: Не удалось открыть данные

# application.startupError.message
source: Your local data couldn't be loaded. Try again.
ru: Не удалось загрузить локальные данные. Попробуйте ещё раз.

# application.startupError.retry
source: Try Again
ru: Повторить

# common.continue
source: Continue
ru: Продолжить

# common.back
source: Back
ru: Назад

# common.cancel
source: Cancel
ru: Отмена

# common.done
source: Done
ru: Готово

# currencySelection.noResults
source: No currencies found
ru: Валюты не найдены

# currencySelection.close
source: Close
ru: Закрыть

# currencySelection.searchPlaceholder
source: Search currencies
ru: Поиск валют

# currencySelection.title
source: Currency
ru: Валюта

# jobSetup.currency.accessibilityHint
source: Opens currency selection.
ru: Открывает выбор валюты.

# jobSetup.currency.title
source: Currency
ru: Валюта

# jobSetup.basePay.amount.accessibilityHint
source: Enter the amount you are paid.
ru: Введите сумму, которую вам платят.

# jobSetup.basePay.fixedPerShift
source: Per shift
ru: За смену

# jobSetup.basePay.fixedPerShift.amountTitle
source: Pay per shift
ru: Сумма за смену

# jobSetup.basePay.hourly
source: By the hour
ru: За час

# jobSetup.basePay.hourly.amountTitle
source: Hourly rate
ru: Ставка за час

# jobSetup.payBasis.title
source: How are you paid?
ru: Как оплачивается эта работа?

# jobSetup.step1.subtitle
source: Name the work, then tell us how it’s paid. Leave out night, weekend, overtime, and other premiums for now.
ru: Назовите работу и укажите, как она оплачивается. Пока без ночных, выходных, сверхурочных и других доплат.

# jobSetup.step1.title
source: Set up your first work type
ru: Настройте первый вид работы

# jobSetup.step2.stepIndicator.accessibilityLabel
source: Step 2 of 3
ru: Шаг 2 из 3

# jobSetup.step2.subtitle
source: This is the period your employer uses to calculate your pay.
ru: Это период, за который работодатель считает зарплату.

# jobSetup.step2.title
source: What is your pay period?
ru: Какой у вас расчётный период?

# jobSetup.payCalculation.perShift
source: One shift
ru: Одна смена

# jobSetup.payPeriod.weekly
source: One week
ru: Неделя

# jobSetup.payPeriod.biweekly
source: Two weeks
ru: Две недели

# jobSetup.payPeriod.calendarMonthly
source: Calendar month
ru: Календарный месяц

# jobSetup.payPeriod.anchor.title
source: Pay period start
ru: Начало расчётного периода

# jobSetup.payPeriod.anchor.subtitle
source: Choose the first day of your current or another known period.
ru: Выберите первый день текущего или другого известного периода.

# jobSetup.payPeriod.anchor.choose
source: Choose date
ru: Выбрать дату

# jobSetup.payPeriod.anchorPicker.title
source: Period start
ru: Начало периода

# jobSetup.stepIndicator.accessibilityLabel
source: Step 1 of 3
ru: Шаг 1 из 3

# jobSetup.step3.stepIndicator.accessibilityLabel
source: Step 3 of 3
ru: Шаг 3 из 3

# jobSetup.step3.title
source: Review your setup
ru: Проверьте настройки

# jobSetup.step3.subtitle
source: You can change these settings later.
ru: Их можно будет изменить позже.

# jobSetup.review.pay
source: Pay
ru: Оплата

# jobSetup.review.workTypeName
source: Work type
ru: Вид работы

# jobSetup.review.pay.hourly
source: By the hour
ru: За час

# jobSetup.review.pay.fixedPerShift
source: Per shift
ru: За смену

# jobSetup.review.amount
source: Amount
ru: Сумма

# jobSetup.review.currency
source: Currency
ru: Валюта

# jobSetup.review.payPeriod
source: Pay period
ru: Расчётный период

# jobSetup.review.payPeriod.perShift
source: One shift
ru: Одна смена

# jobSetup.review.payPeriod.weekly
source: One week
ru: Неделя

# jobSetup.review.payPeriod.biweekly
source: Two weeks
ru: Две недели

# jobSetup.review.payPeriod.calendarMonthly
source: Calendar month
ru: Календарный месяц

# jobSetup.review.periodStart
source: Period start
ru: Начало периода

# jobSetup.review.timeZone
source: Time zone
ru: Часовой пояс

# jobSetup.start
source: Start
ru: Начать

# jobSetup.review.saveError
source: We couldn’t save your setup. Try again.
ru: Не удалось сохранить настройки. Попробуйте ещё раз.

# jobSetup.workTypeName.accessibilityHint
source: Enter a name that identifies this type of work.
ru: Введите название, по которому вы узнаете этот вид работы.

# jobSetup.workTypeName.placeholder
source: For example, Lectures
ru: Например, Лекции

# jobSetup.workTypeName.title
source: Work type name
ru: Название вида работы

# jobSetup.timeZone.title
source: Time zone
ru: Часовой пояс

# jobSetup.timeZone.searchPlaceholder
source: Search time zones
ru: Поиск часовых поясов

# common.ok
source: OK
ru: Понятно

# editShift.title
source: Edit Shift
ru: Редактировать смену

# editShift.save
source: Save
ru: Сохранить

# editShift.error.overlap.title
source: Shift overlaps another shift
ru: Смена пересекается с другой

# editShift.error.overlap.message
source: Adjust the start or end time and try again.
ru: Измените время начала или окончания и попробуйте снова.

# editShift.error.generic.title
source: Couldn’t save shift
ru: Не удалось сохранить смену

# editShift.error.generic.message
source: Your changes weren’t saved. Try again.
ru: Изменения не сохранены. Попробуйте ещё раз.

# addShift.title
source: New shift
ru: Новая смена

# addShift.save
source: Save
ru: Сохранить

# addShift.saveSuccess.title
source: Shift saved
ru: Смена сохранена

# addShift.start
source: Start
ru: Начало

# addShift.end
source: End
ru: Окончание

# addShift.select
source: Select
ru: Выберите

# addShift.workType
source: Work type
ru: Вид работы

# addShift.workType.unnamed
source: Unnamed work type
ru: Вид работы без названия

# addShift.workType.accessibilityHint
source: Choose the work type for this shift.
ru: Выберите вид работы для этой смены.

# addShift.timeZone.prefix
source: Time zone:
ru: Часовой пояс:

# addShift.unpaidBreak
source: Unpaid break
ru: Неоплачиваемый перерыв

# addShift.breakStart
source: Break start
ru: Начало перерыва

# addShift.breakEnd
source: Break end
ru: Окончание перерыва

# addShift.picker.shiftStart
source: Shift start
ru: Начало смены

# addShift.picker.shiftEnd
source: Shift end
ru: Окончание смены

# addShift.picker.breakStart
source: Break start
ru: Начало перерыва

# addShift.picker.breakEnd
source: Break end
ru: Окончание перерыва

# addShift.error.overlap.title
source: Shift overlaps another shift
ru: Смена пересекается с другой

# addShift.error.overlap.message
source: Change the start or end time.
ru: Измените время начала или окончания.

# addShift.error.generic.title
source: Couldn’t save shift
ru: Не удалось сохранить смену

# addShift.error.generic.message
source: Try again.
ru: Попробуйте ещё раз.

# addShift.validation.endAfterStart
source: End must be later than start.
ru: Окончание должно быть позже начала.

# addShift.validation.duration
source: A shift can’t be longer than 48 hours.
ru: Смена не может длиться больше 48 часов.

# addShift.validation.breakEndAfterStart
source: Break end must be later than break start.
ru: Окончание перерыва должно быть позже начала.

# addShift.validation.breakInsideShift
source: The break must be within the shift.
ru: Перерыв должен находиться внутри смены.

# addShift.validation.breakWholeShift
source: The break can’t cover the entire shift.
ru: Перерыв не может занимать всю смену.

# actualGrossEntry.title
source: Check paycheck
ru: Проверить начисление

# actualGrossEntry.question
source: What gross amount did your employer report?
ru: Какую сумму до вычетов указал работодатель?

# actualGrossEntry.supporting
source: Enter the gross amount shown by your employer for this pay period.
ru: Введите сумму до вычетов, указанную работодателем за этот расчётный период.

# actualGrossEntry.amount
source: Actual gross
ru: Фактическая сумма до вычетов

# actualGrossEntry.compare
source: Compare
ru: Сравнить

# actualGrossEntry.validation.invalid
source: Enter a valid amount.
ru: Введите корректную сумму.

# overview.title
source: Overview
ru: Обзор

# overview.expectedGross
source: Expected gross
ru: Ожидаемая сумма до вычетов

# overview.expectedGross.context
source: Expected gross · %@
ru: Ожидаемая сумма до вычетов · %@

# overview.shiftSection.prefix
source: Shifts ·
ru: Смены ·

# overview.shiftsInPeriod
source: Shifts in period
ru: Смен в периоде

# overview.shiftHistory.empty
source: No shifts in this pay period.
ru: В этом расчётном периоде нет смен.

# overview.shift.paidDuration
source: %@ paid
ru: %@ оплачено

# overview.shift.payBasis
source: Pay basis
ru: Основание оплаты

# overview.shift.expand
source: Shows shift details.
ru: Показывает детали смены.

# overview.shift.collapse
source: Hides shift details.
ru: Скрывает детали смены.

# overview.shift.expanded
source: Expanded
ru: Развернута

# overview.shift.collapsed
source: Collapsed
ru: Свернута

# overview.checkPaycheck
source: Check paycheck
ru: Проверить начисление

# overview.addShift
source: Add shift
ru: Добавить смену

# overview.addWorkType
source: Add work type
ru: Добавить вид работы

# overview.editShift
source: Edit shift
ru: Редактировать смену

# overview.previousPeriod
source: Previous pay period
ru: Предыдущий расчётный период

# overview.nextPeriod
source: Next pay period
ru: Следующий расчётный период

# overview.empty.title
source: No shifts yet
ru: Смен пока нет

# overview.empty.message
source: Add a shift to calculate your expected gross.
ru: Добавьте смену, чтобы рассчитать ожидаемую сумму до вычетов.

# overview.error.loading.title
source: Couldn’t load your shifts
ru: Не удалось загрузить смены

# overview.error.loading.message
source: Try again.
ru: Попробуйте ещё раз.

# overview.error.calculation.title
source: Couldn’t calculate expected pay
ru: Не удалось рассчитать ожидаемую оплату

# overview.error.calculation.message
source: Try again.
ru: Попробуйте ещё раз.

# overview.retry
source: Try again
ru: Повторить

# application.paycheckComparisonError.title
source: Couldn't compare paycheck
ru: Не удалось сравнить начисление

# application.paycheckComparisonError.message
source: Try again.
ru: Попробуйте ещё раз.

# paycheckResult.title
source: Paycheck comparison
ru: Сравнение начисления

# paycheckResult.expected
source: Expected gross
ru: Ожидаемая сумма до вычетов

# paycheckResult.actual
source: Reported gross
ru: Указанная сумма до вычетов

# paycheckResult.difference
source: Difference
ru: Разница

# paycheckResult.lower
source: Reported gross is lower than expected.
ru: Указанная сумма ниже ожидаемой.

# paycheckResult.equal
source: Reported gross matches expected gross.
ru: Указанная сумма совпадает с ожидаемой.

# paycheckResult.higher
source: Reported gross is higher than expected.
ru: Указанная сумма выше ожидаемой.

# paycheckResult.breakdown.title
source: Expected gross breakdown
ru: Расчёт ожидаемой суммы

# paycheckResult.breakdown.empty
source: No shifts contributed to this expected gross.
ru: В эту ожидаемую сумму не вошла ни одна смена.

# paycheckResult.shift.paidTime
source: Paid time
ru: Оплачиваемое время

# paycheckResult.shift.rate
source: Rate
ru: Ставка

# paycheckResult.shift.expected
source: Expected
ru: Ожидаемо

# paycheckResult.rate.hour
source: hour
ru: час

# paycheckResult.rate.shift
source: shift
ru: смена

# paycheckResult.duration.hour
source: h
ru: ч

# paycheckResult.duration.minute
source: min
ru: мин

# paycheckResult.duration.lessThanSecond
source: < 1 sec
ru: < 1 с

# paycheckResult.duration.second
source: sec
ru: с
